## Production: glue 🧴
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 0 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                            |
|--------|-----------------------------------------------------------|
| add    | `aws_glue_crawler.platform_gc_forms_templates_production` |
|        | `aws_glue_job.bes_crm_salesforce`                         |
|        | `aws_glue_trigger.bes_crm_salesforce`                     |
| delete | `aws_glue_crawler.platform_gc_forms_forms_production`     |
|        | `aws_glue_job.forms_generate_test_data`                   |
|        | `aws_s3_object.forms_generate_test_data`                  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_glue_crawler.platform_gc_forms_forms_production will be destroyed
  # (because aws_glue_crawler.platform_gc_forms_forms_production is not in configuration)
  - resource "aws_glue_crawler" "platform_gc_forms_forms_production" {
      - arn                    = "arn:aws:glue:ca-central-1:739275439843:crawler/Platform / GC Forms / Forms" -> null
      - classifiers            = [] -> null
      - configuration          = jsonencode(
            {
              - CrawlerOutput        = {
                  - Tables = {
                      - TableThreshold = 3
                    }
                }
              - CreatePartitionIndex = true
              - Version              = 1.0
            }
        ) -> null
      - database_name          = "platform_gc_forms_production" -> null
      - description            = "Classify the GC Forms forms (template) data" -> null
      - id                     = "Platform / GC Forms / Forms" -> null
      - name                   = "Platform / GC Forms / Forms" -> null
      - role                   = "service-role/AWSGlueCrawler-DataLake" -> null
      - security_configuration = "encryption-at-rest" -> null
      - table_prefix           = "forms_" -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "CostCentre" = "PlatformDataLake"
          - "Terraform"  = "true"
        } -> null
        # (1 unchanged attribute hidden)

      - lake_formation_configuration {
          - use_lake_formation_credentials = false -> null
            # (1 unchanged attribute hidden)
        }

      - lineage_configuration {
          - crawler_lineage_settings = "DISABLE" -> null
        }

      - recrawl_policy {
          - recrawl_behavior = "CRAWL_EVERYTHING" -> null
        }

      - s3_target {
          - exclusions          = [] -> null
          - path                = "s3://cds-data-lake-transformed-production/platform/gc-forms/forms" -> null
          - sample_size         = 0 -> null
            # (3 unchanged attributes hidden)
        }

      - schema_change_policy {
          - delete_behavior = "DEPRECATE_IN_DATABASE" -> null
          - update_behavior = "UPDATE_IN_DATABASE" -> null
        }
    }

  # aws_glue_crawler.platform_gc_forms_templates_production will be created
  + resource "aws_glue_crawler" "platform_gc_forms_templates_production" {
      + arn                    = (known after apply)
      + configuration          = jsonencode(
            {
              + CrawlerOutput        = {
                  + Tables = {
                      + TableThreshold = 3
                    }
                }
              + CreatePartitionIndex = true
              + Version              = 1
            }
        )
      + database_name          = "platform_gc_forms_production"
      + description            = "Classify the GC Forms template data"
      + id                     = (known after apply)
      + name                   = "Platform / GC Forms / Templates"
      + role                   = "arn:aws:iam::739275439843:role/service-role/AWSGlueCrawler-DataLake"
      + security_configuration = "encryption-at-rest"
      + table_prefix           = "forms_"
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + s3_target {
          + path = "s3://cds-data-lake-transformed-production/platform/gc-forms"
        }
    }

  # aws_glue_job.bes_crm_salesforce will be created
  + resource "aws_glue_job" "bes_crm_salesforce" {
      + arn                    = (known after apply)
      + default_arguments      = {
          + "--additional-python-modules"        = "s3://cds-data-lake-glue-production/bes/crm/salesforce/requirements.txt"
          + "--continuous-log-logGroup"          = "/aws-glue/jobs/encryption-at-rest/service-role/AWSGlueETL-DataLake/output"
          + "--continuous-log-logStreamPrefix"   = "bes_crm_salesforce"
          + "--database_name_transformed"        = "bes_crm_salesforce_production"
          + "--enable-auto-scaling"              = "true"
          + "--enable-continuous-cloudwatch-log" = "true"
          + "--enable-continuous-log-filter"     = "true"
          + "--enable-job-insights"              = "true"
          + "--enable-metrics"                   = "true"
          + "--enable-observability-metrics"     = "true"
          + "--job-language"                     = "python"
          + "--python-modules-installer-option"  = "-r"
          + "--source_bucket"                    = "cds-data-lake-raw-production"
          + "--source_prefix"                    = "bes/crm/salesforce/"
          + "--table_name"                       = "account_opportunity"
          + "--transformed_bucket"               = "cds-data-lake-transformed-production"
          + "--transformed_prefix"               = "bes/crm/salesforce/"
        }
      + execution_class        = "FLEX"
      + glue_version           = "5.0"
      + id                     = (known after apply)
      + max_capacity           = 0.0625
      + name                   = "BES / CRM / Salesforce"
      + number_of_workers      = (known after apply)
      + role_arn               = "arn:aws:iam::739275439843:role/service-role/AWSGlueETL-DataLake"
      + security_configuration = "encryption-at-rest"
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + timeout                = 15
      + worker_type            = (known after apply)

      + command {
          + name            = "pythonshell"
          + python_version  = "3"
          + runtime         = (known after apply)
          + script_location = "s3://cds-data-lake-glue-production/bes/crm/salesforce/process_salesforce.py"
        }

      + execution_property (known after apply)

      + notification_property (known after apply)
    }

  # aws_glue_job.forms_generate_test_data will be destroyed
  # (because aws_glue_job.forms_generate_test_data is not in configuration)
  - resource "aws_glue_job" "forms_generate_test_data" {
      - arn                       = "arn:aws:glue:ca-central-1:739275439843:job/Platform / GC Forms / Generate test data" -> null
      - connections               = [] -> null
      - default_arguments         = {
          - "--continuous-log-logGroup"          = "/aws-glue/jobs/encryption-at-rest/service-role/AWSGlueETL-DataLake/output"
          - "--continuous-log-logStreamPrefix"   = "forms_generate_test_data"
          - "--enable-continuous-cloudwatch-log" = "true"
          - "--enable-continuous-log-filter"     = "true"
          - "--enable-metrics"                   = "true"
          - "--enable-observability-metrics"     = "true"
          - "--num_partitions"                   = "1"
          - "--output_s3_path"                   = "s3://cds-data-lake-transformed-production/platform/gc-forms/forms/test/"
        } -> null
      - glue_version              = "4.0" -> null
      - id                        = "Platform / GC Forms / Generate test data" -> null
      - job_run_queuing_enabled   = false -> null
      - max_capacity              = 10 -> null
      - max_retries               = 0 -> null
      - name                      = "Platform / GC Forms / Generate test data" -> null
      - non_overridable_arguments = {} -> null
      - number_of_workers         = 10 -> null
      - role_arn                  = "arn:aws:iam::739275439843:role/service-role/AWSGlueETL-DataLake" -> null
      - security_configuration    = "encryption-at-rest" -> null
      - tags                      = {} -> null
      - tags_all                  = {
          - "CostCentre" = "PlatformDataLake"
          - "Terraform"  = "true"
        } -> null
      - timeout                   = 15 -> null
      - worker_type               = "G.1X" -> null
        # (3 unchanged attributes hidden)

      - command {
          - name            = "glueetl" -> null
          - python_version  = "3" -> null
          - script_location = "s3://cds-data-lake-glue-production/platform/gc-forms/generate_test_data.py" -> null
            # (1 unchanged attribute hidden)
        }

      - execution_property {
          - max_concurrent_runs = 1 -> null
        }
    }

  # aws_glue_trigger.bes_crm_salesforce will be created
  + resource "aws_glue_trigger" "bes_crm_salesforce" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "BES / CRM / Salesforce"
      + schedule = "cron(00 7 * * ? *)"
      + state    = (known after apply)
      + tags_all = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + type     = "SCHEDULED"

      + actions {
          + job_name = "BES / CRM / Salesforce"
        }
    }

  # aws_s3_object.forms_generate_test_data will be destroyed
  # (because aws_s3_object.forms_generate_test_data is not in configuration)
  - resource "aws_s3_object" "forms_generate_test_data" {
      - arn                           = "arn:aws:s3:::cds-data-lake-glue-production/platform/gc-forms/generate_test_data.py" -> null
      - bucket                        = "cds-data-lake-glue-production" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/octet-stream; charset=UTF-8" -> null
      - etag                          = "41a28d43ff5059f34c1a64c84ff980dd" -> null
      - force_destroy                 = false -> null
      - id                            = "platform/gc-forms/generate_test_data.py" -> null
      - key                           = "platform/gc-forms/generate_test_data.py" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "./etl/platform/gc-forms/scripts/generate_test_data.py" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "CostCentre" = "PlatformDataLake"
          - "Terraform"  = "true"
        } -> null
      - version_id                    = "KL9EejDIn4b7T220WZ4nKWbucl2oeIaK" -> null
        # (12 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_crm_salesforce_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_crm_salesforce_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_account_tags"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_cost_usage_report"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_gc_forms_templates_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_support_freshdesk_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.bes_crm_salesforce"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_support_freshdesk"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.bes_crm_salesforce"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.platform_support_freshdesk"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.aws_glue"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
